Repository: wanggzfdm/my-clipaste
Catalog: clipaste/Localizable.xcstrings
Source language: en
Languages: de, fr, ja, ko, zh_hans, zh_hant

source: No active AI configuration is available.
de: Keine aktive KI-Konfiguration verfügbar.
fr: Aucune configuration IA active n’est disponible.
ja: 利用可能な有効な AI 設定がありません。
ko: 사용 가능한 활성 AI 구성이 없습니다.
zh_hans: 没有可用的已激活 AI 配置。
zh_hant: 沒有可用的已啟用 AI 設定。

source: No AI Configurations
de: Keine KI-Konfigurationen
fr: Aucune configuration IA
ja: AI 設定がありません
ko: AI 구성 없음
zh_hans: 暂无 AI 配置
zh_hant: 尚無 AI 設定

source: No AI Skills
de: Keine KI-Fähigkeiten
fr: Aucune compétence IA
ja: AIスキルがありません
ko: AI 기술 없음
zh_hans: 暂无 AI 技能
zh_hant: 尚無 AI 技能

source: No AI Skills Available
de: Keine KI-Fähigkeiten für dieses Element verfügbar
fr: Aucune compétence IA disponible pour cet élément
ja: この項目で使える AI スキルがありません
ko: 이 항목에 사용할 수 있는 AI 기술이 없습니다
zh_hans: 没有适用于此 Item 的 AI 技能
zh_hant: 沒有適用於此項目的 AI 技能

source: No clipboard item is available to replace.
de: Es ist kein Zwischenablageelement zum Ersetzen verfügbar.
fr: Aucun élément du presse-papiers n’est disponible à remplacer.
ja: 置き換えられるクリップボード項目がありません。
ko: 바꿀 수 있는 클립보드 항목이 없습니다.
zh_hans: 没有可替换的剪切板 Item。
zh_hant: 沒有可替換的剪貼簿 Item。

source: No Custom Groups
de: Keine eigenen Gruppen
fr: Aucun groupe personnalisé
ja: カスタムグループなし
ko: 사용자 지정 그룹 없음
zh_hans: 尚无自訂分组
zh_hant: 尚無自訂群組

source: No Events Recorded
de: Keine Ereignisse aufgezeichnet
fr: Aucun événement enregistré
ja: 記録されたイベントはありません
ko: 기록된 이벤트가 없습니다
zh_hans: 暂无记录事件
zh_hant: 尚無事件記錄

source: No Groups
de: Keine Gruppen
fr: Aucun groupe
ja: グループなし
ko: 그룹 없음
zh_hans: 暂无分组
zh_hant: 尚無群組

source: No ignored apps yet
de: Noch keine ignorierten Apps
fr: Aucune app ignorée pour le moment
ja: 除外するアプリはまだありません
ko: 아직 제외된 앱이 없습니다
zh_hans: 还没有排除的应用
zh_hant: 尚無排除的應用程式

source: No importable records were found in the %@ file.
de: In der Datei %@ wurden keine importierbaren Einträge gefunden.
fr: Aucun enregistrement importable n’a été trouvé dans le fichier %@.
ja: %@ ファイルにインポート可能なレコードが見つかりませんでした。
ko: %@ 파일에서 가져올 수 있는 기록을 찾지 못했습니다.
zh_hans: 在 %@ 文件中未找到可导入记录。
zh_hant: 在 %@ 檔案中未找到可匯入的記錄。

source: No Matches Found
de: Keine Übereinstimmungen
fr: Aucun résultat
ja: 一致する項目が見つかりません
ko: 일치하는 항목 없음
zh_hans: 找不到相符項目
zh_hant: 找不到相符項目

source: No Supported Content
de: Keine unterstützten Inhalte
fr: Aucun contenu pris en charge
ja: 対応コンテンツなし
ko: 지원되는 콘텐츠 없음
zh_hans: 未选择适用内容
zh_hant: 未選擇適用內容

source: None
de: Keine
fr: Aucun
ja: なし
ko: 없음
zh_hans: 无
zh_hant: 無

source: Not Initialized
de: Nicht initialisiert
fr: Non initialisé
ja: 未初期化
ko: 초기화되지 않음
zh_hans: 未初始化
zh_hant: 未初始化

# OCR Found No Text
source: No text was found in the image.
de: Im Bild wurde kein Text gefunden.
fr: Aucun texte détecté dans l’image.
ja: 画像内にテキストは見つかりませんでした。
ko: 이미지에서 텍스트를 찾을 수 없습니다.
zh_hans: 未在图片中识别到文字。
zh_hant: 未在圖片中辨識到文字。

source: OCR Result
de: OCR-Ergebnis
fr: Résultat OCR
ja: OCR 結果
ko: OCR 결과
zh_hans: OCR 识别结果
zh_hant: OCR 辨識結果

source: Off
de: Aus
fr: Désactivé
ja: オフ
ko: 꺼짐
zh_hans: 关闭
zh_hant: 關閉

source: Official Website
de: Offizielle Website
fr: Site officiel
ja: 公式サイト
ko: 공식 웹사이트
zh_hans: 官方网站
zh_hant: 官方網站

source: On
de: Ein
fr: Activé
ja: オン
ko: 켜짐
zh_hans: 开启
zh_hant: 開啟

source: Open Accessibility Settings…
de: Bedienungshilfen öffnen…
fr: Ouvrir les réglages d'accessibilité…
ja: アクセシビリティ設定を開く…
ko: 손쉬운 사용 설정 열기…
zh_hans: 打开「辅助功能」设置…
zh_hant: 打開「輔助使用」設定…

source: Open AI Conversation
de: KI-Unterhaltung öffnen
fr: Ouvrir la conversation IA
ja: AI会話を開く
ko: AI 대화 열기
zh_hans: 打开 AI 对话
zh_hant: 開啟 AI 對話

source: Open AI Settings…
de: KI-Einstellungen öffnen…
fr: Ouvrir les réglages IA…
ja: AI設定を開く…
ko: AI 설정 열기…
zh_hans: 打开 AI 设置…
zh_hant: 開啟 AI 設定…

source: Open Conversation After Running
de: Unterhaltung nach Ausführung öffnen
fr: Ouvrir la conversation après l’exécution
ja: 実行後に会話を開く
ko: 실행 후 대화 열기
zh_hans: 运行后打开对话
zh_hant: 執行後開啟對話

source: Open in %@
de: In %1$@ öffnen
fr: Ouvrir dans %1$@
ja: %1$@で開く
ko: %1$@에서 열기
zh_hans: 在 %1$@ 中打开
zh_hant: 在 %1$@ 中打開

source: Open System Settings to Authorize
de: Systemeinstellungen öffnen und autorisieren
fr: Ouvrir les Réglages Système pour autoriser
ja: システム設定を開いて権限を付与
ko: 시스템 설정 열어서 권한 허용
zh_hans: 打开系统设置授权
zh_hant: 打開系統設定授權

source: Output Mode
de: Ausgabemodus
fr: Mode de sortie
ja: 出力方法
ko: 출력 방식
zh_hans: 输出方式
zh_hant: 輸出方式

source: Panel Shortcuts
de: Panel-Kurzbefehle
fr: Raccourcis du panneau
ja: パネル内ショートカット
ko: 패널 단축키
zh_hans: 面板内快捷键
zh_hant: 面板內快捷鍵

source: Parsed %lld %@ records and writing them into Clipaste…
de: %1$lld %@-Einträge wurden verarbeitet, sie werden jetzt in Clipaste geschrieben…
fr: %1$lld enregistrements %@ analysés, écriture dans Clipaste…
ja: %2$@ のレコードを %1$lld 件解析しました。Clipaste に書き込み中…
ko: %2$@ 기록 %1$lld개를 해석했으며 Clipaste에 기록하는 중…
zh_hans: 已解析 %1$lld 条 %2$@ 记录，正在写入 Clipaste…
zh_hant: 已解析 %1$lld 筆 %2$@ 記錄，正在寫入 Clipaste…

source: Paste
de: Einsetzen
fr: Coller
ja: ペースト
ko: 붙여넣기
zh_hans: 粘贴
zh_hant: 貼上

source: Paste as Plain Text
de: Als einfachen Text einsetzen
fr: Coller en texte brut
ja: プレーンテキストでペースト
ko: 일반 텍스트로 붙여넣기
zh_hans: 以纯文字粘贴
zh_hant: 以純文字貼上

source: Paste Directly to Active App
de: Direkt in aktive App einsetzen
fr: Coller directement dans l'app active
ja: 現在のアプリに直接貼り付け
ko: 활성 앱에 직접 붙여넣기
zh_hans: 直接粘贴到目前的 App
zh_hant: 直接貼上到目前的 App

source: Paste Result to Active App
de: Ergebnis in die aktive App einfügen
fr: Coller le résultat dans l’app active
ja: 結果を現在のアプリにペースト
ko: 결과를 현재 앱에 붙여넣기
zh_hans: 粘贴结果到当前 App
zh_hant: 貼上結果到目前 App

source: Paste to Current App
de: In aktuelle App einsetzen
fr: Coller dans l'app active
ja: 現在のアプリにペースト
ko: 현재 앱에 붙여넣기
zh_hans: 粘贴到目前的 App
zh_hant: 貼上到目前的 App

source: Pause Monitoring
de: Überwachung pausieren
fr: Suspendre la surveillance
ja: 監視を一時停止
ko: 모니터링 일시 중지
zh_hans: 暂停监听
zh_hant: 暫停監聽

source: Pending Disable
de: Deaktivierung ausstehend
fr: Désactivation en attente
ja: 無効化待ち
ko: 비활성화 대기 중
zh_hans: 待关闭
zh_hant: 待停用

source: Pending Enable
de: Aktivierung ausstehend
fr: Activation en attente
ja: 有効化待ち
ko: 활성화 대기 중
zh_hans: 待开启
zh_hant: 待啟用

source: Pending Toggle
de: Ausstehende Umschaltung
fr: Bascule en attente
ja: 保留中の切替状態
ko: 대기 중인 토글
zh_hans: 待处理开关
zh_hant: 待處理開關

source: Permanently deletes all clipboard records and image caches. This cannot be undone.
de: Löscht dauerhaft alle Zwischenablagen-Einträge und Bildcaches. Dies kann nicht rückgängig gemacht werden.
fr: Supprime définitivement les entrées du presse-papiers qui ne sont pas dans les favoris ainsi que le cache images. Les éléments figurant dans les favoris sont conservés.
ja: すべてのクリップボード記録と画像キャッシュを完全に削除します。この操作は元に戻せません。
ko: 모든 클립보드 기록과 이미지 캐시를 영구적으로 삭제합니다. 취소할 수 없습니다.
zh_hans: 永久删除所有剪贴板记录和图片缓存，此操作无法撤销。
zh_hant: 將永久刪除所有剪貼板記錄及相關圖片快取，且無法復原。

source: Permanently deletes non-favorite clipboard records and image caches. Items in Favorites are kept.
de: Löscht dauerhaft nicht favorisierte Zwischenablageeinträge und Bildcaches. Elemente in den Favoriten bleiben erhalten.
fr: Supprime définitivement les éléments du presse-papiers non favoris et les caches d’images. Les éléments dans les favoris sont conservés.
ja: お気に入り以外のクリップボード履歴と画像キャッシュを完全に削除します。お気に入りの項目は保持されます。
ko: 즐겨찾기가 아닌 클립보드 기록과 이미지 캐시를 영구적으로 삭제합니다. 즐겨찾기의 항목은 유지됩니다.
zh_hans: 永久删除非收藏的剪贴板记录和图片缓存，收藏中的内容会被保留。
zh_hant: 永久刪除非收藏的剪貼簿記錄和圖片快取，收藏中的內容會被保留。

source: Permission Granted — Continue
de: Berechtigung erteilt — Weiter
fr: Autorisation accordée — Continuer
ja: 承認済み — 続行できます
ko: 권한 허용됨 — 계속하기
zh_hans: 已完成授权，可继续下一步
zh_hant: 已完成授權，可繼續下一步

source: Permission Required — Complete System Authorization
de: Berechtigung erforderlich — Systemzulassung abschließen
fr: Autorisation requise — Veuillez compléter l'autorisation système
ja: 権限が必要です — システム認証を完了してください
ko: 권한 필요 — 시스템 권한을 먼저 허용하세요
zh_hans: 尚未授权，请先完成系统授权
zh_hant: 尚未授權，請先完成系統授權

source: Pin
de: Anheften
fr: Épingler
ja: ピン留め
ko: 고정
zh_hans: 固定
zh_hant: 固定

source: Pin Panel
de: Panel anheften
fr: Épingler le panneau
ja: パネルを固定
ko: 패널 고정
zh_hans: 固定面板
zh_hant: 固定面板

source: Plain Text Mode
de: Nur-Text-Modus
fr: Mode texte brut
ja: プレーンテキストモード
ko: 일반 텍스트 모드
zh_hans: 纯文本模式
zh_hant: 純文字模式

source: Plain Text Quick Paste
de: Klartext-Schnelleinfügen
fr: Collage rapide en texte brut
ja: プレーンテキスト即時貼り付け
ko: 일반 텍스트 빠른 붙여넣기
zh_hans: 一键纯文本粘贴
zh_hant: 一鍵純文字貼上

source: Play a short sound after copying to the clipboard.
de: Kurzer Ton nach dem Kopieren in die Zwischenablage.
fr: Joue un bref son après la copie dans le presse-papiers.
ja: クリップボードへコピーした直後に短い音を再生します。
ko: 클립보드로 복사한 뒤 짧은 알림음을 재생합니다.
zh_hans: 复制内容到剪贴板后播放短促提示音。
zh_hant: 複製內容到剪貼簿後播放短促提示音。

source: Preparing update…
de: Update wird vorbereitet…
fr: Préparation de la mise à jour…
ja: アップデートを準備中…
ko: 업데이트를 준비하는 중…
zh_hans: 正在准备更新…
zh_hant: 正在準備更新…

# Preset Prompt Explain Code
source: Explain what the code below does, including inputs, outputs, key logic, and possible risks. If there are improvements, suggest them: {{clipboard.text}}
de: Erkläre, was der folgende Code tut, einschließlich Eingaben, Ausgaben, Kernlogik und möglicher Risiken. Wenn es Verbesserungsmöglichkeiten gibt, schlage sie vor: {{clipboard.text}}
fr: Explique ce que fait le code ci-dessous, y compris les entrées, les sorties, la logique clé et les risques possibles. S’il peut être amélioré, propose des suggestions : {{clipboard.text}}
ja: 以下のコードが何をするのか、入力、出力、主要なロジック、考えられるリスクを含めて説明してください。改善できる点があれば提案してください。 {{clipboard.text}}
ko: 아래 코드가 무엇을 하는지 입력, 출력, 핵심 로직, 가능한 위험을 포함해 설명하세요. 개선할 수 있는 점이 있다면 제안하세요. {{clipboard.text}}
zh_hans: 请解释以下代码的作用、输入输出、关键逻辑和可能的风险。如果能改进，请给出建议： {{clipboard.text}}
zh_hant: 請解釋以下程式碼的作用、輸入輸出、關鍵邏輯和可能的風險。如果能改進，請給出建議： {{clipboard.text}}

# Preset Prompt Extract Emails
source: Extract all email addresses from the clipboard content below. Deduplicate them, keep original casing, output one email per line, and do not include any extra explanation: {{clipboard.text}}
de: Extrahiere alle E-Mail-Adressen aus dem folgenden Zwischenablageninhalt. Entferne Duplikate, behalte die originale Groß- und Kleinschreibung bei, gib pro Zeile eine Adresse aus und füge keine weitere Erklärung hinzu: {{clipboard.text}}
fr: Extrais toutes les adresses e-mail du contenu du presse-papiers ci-dessous. Supprime les doublons, conserve la casse originale, affiche une adresse par ligne et n’ajoute aucune explication : {{clipboard.text}}
ja: 以下のクリップボード内容からすべてのメールアドレスを抽出してください。重複を削除し、元の大文字小文字を保ち、1行に1件ずつ出力し、余計な説明は追加しないでください。 {{clipboard.text}}
ko: 아래 클립보드 내용에서 모든 이메일 주소를 추출하세요. 중복을 제거하고 원래 대소문자를 유지하며 한 줄에 하나씩 출력하고 추가 설명은 포함하지 마세요. {{clipboard.text}}
zh_hans: 请从以下剪切板内容中提取所有邮箱地址。去重，保留原始大小写，每行输出一个邮箱，不要输出其他说明： {{clipboard.text}}
zh_hant: 請從以下剪貼簿內容中提取所有郵箱地址。去重，保留原始大小寫，每行輸出一個郵箱，不要輸出其他說明： {{clipboard.text}}

# Preset Prompt Format JSON
source: Parse and format the JSON below using 2-space indentation. Output only the formatted JSON. If the content is not valid JSON, explain the error clearly: {{clipboard.text}}
de: Analysiere und formatiere das folgende JSON mit 2 Leerzeichen Einrückung. Gib nur das formatierte JSON aus. Wenn der Inhalt kein gültiges JSON ist, erkläre den Fehler klar: {{clipboard.text}}
fr: Analyse et formate le JSON ci-dessous avec une indentation de 2 espaces. N’affiche que le JSON formaté. Si le contenu n’est pas un JSON valide, explique clairement l’erreur : {{clipboard.text}}
ja: 以下のJSONを解析し、2スペースのインデントで整形してください。整形後のJSONのみを出力してください。内容が有効なJSONでない場合は、エラーの原因を明確に説明してください。 {{clipboard.text}}
ko: 아래 JSON을 파싱하고 2칸 들여쓰기로 서식을 지정하세요. 서식 지정된 JSON만 출력하세요. 유효한 JSON이 아니면 오류 원인을 명확히 설명하세요. {{clipboard.text}}
zh_hans: 请解析并格式化以下 JSON，使用 2 个空格缩进。只输出格式化后的 JSON；如果内容不是合法 JSON，请指出错误原因： {{clipboard.text}}
zh_hant: 請解析並格式化以下 JSON，使用 2 個空格縮排。只輸出格式化後的 JSON；如果內容不是合法 JSON，請指出錯誤原因： {{clipboard.text}}

# Preset Prompt Image OCR
source: Clean up the OCR text extracted from the image below. Preserve the original order and meaning, fix obvious OCR mistakes, remove unnecessary blank lines, and output only the cleaned text: {{clipboard.text}}
de: Bereinige den folgenden OCR-Text aus dem Bild. Behalte die ursprüngliche Reihenfolge und Bedeutung bei, korrigiere offensichtliche OCR-Fehler, entferne unnötige Leerzeilen und gib nur den bereinigten Text aus: {{clipboard.text}}
fr: Nettoie le texte OCR extrait de l’image ci-dessous. Conserve l’ordre et le sens d’origine, corrige les erreurs OCR évidentes, supprime les lignes vides inutiles et n’affiche que le texte nettoyé : {{clipboard.text}}
ja: 以下の画像から抽出されたOCRテキストを整えてください。元の順序と意味を保ち、明らかなOCRミスを修正し、不要な空行を削除して、整えたテキストのみを出力してください。 {{clipboard.text}}
ko: 아래 이미지에서 추출된 OCR 텍스트를 정리하세요. 원래 순서와 의미를 유지하고 명백한 OCR 오류를 수정하며 불필요한 빈 줄을 제거한 뒤 정리된 텍스트만 출력하세요. {{clipboard.text}}
zh_hans: 请整理以下从图片中识别出的 OCR 文本。保留原始顺序和含义，修正明显的识别错误，移除不必要的空行，只输出整理后的文本： {{clipboard.text}}
zh_hant: 請整理以下從圖片中識別出的 OCR 文字。保留原始順序和含義，修正明顯的識別錯誤，移除不必要的空行，只輸出整理後的文字： {{clipboard.text}}

# Preset Prompt Improve Writing
source: Improve the writing below so it is clearer, more natural, and more professional. Preserve the original meaning, do not add unsupported details, and output only the revised text: {{clipboard.text}}
de: Verbessere den folgenden Text, damit er klarer, natürlicher und professioneller klingt. Behalte die ursprüngliche Bedeutung bei, füge keine unbelegten Informationen hinzu und gib nur die überarbeitete Fassung aus: {{clipboard.text}}
fr: Améliore le texte ci-dessous pour le rendre plus clair, plus naturel et plus professionnel. Conserve le sens original, n’ajoute aucune information non fournie et n’affiche que la version révisée : {{clipboard.text}}
ja: 以下の文章を、より明確で自然かつプロフェッショナルに改善してください。元の意味を保ち、根拠のない情報は追加せず、修正版の文章のみを出力してください。 {{clipboard.text}}
ko: 아래 글을 더 명확하고 자연스러우며 전문적으로 다듬어 주세요. 원래 의미를 유지하고 근거 없는 내용은 추가하지 말며 수정된 텍스트만 출력하세요. {{clipboard.text}}
zh_hans: 请润色以下文本，让表达更清晰、自然、专业。保留原意，不要添加不存在的信息，只输出润色后的文本： {{clipboard.text}}
zh_hant: 請潤飾以下文字，讓表達更清晰、自然、專業。保留原意，不要添加不存在的資訊，只輸出潤飾後的文字： {{clipboard.text}}

# Preset Prompt JSON to TypeScript
source: Generate TypeScript interfaces from the JSON below. Use clear interface names, handle optional fields and arrays reasonably, and output only TypeScript code: {{clipboard.text}}
de: Erzeuge TypeScript-Interfaces aus dem folgenden JSON. Verwende klare Interface-Namen, behandle optionale Felder und Arrays sinnvoll und gib nur TypeScript-Code aus: {{clipboard.text}}
fr: Génère des interfaces TypeScript à partir du JSON ci-dessous. Utilise des noms d’interface clairs, gère raisonnablement les champs optionnels et les tableaux, et n’affiche que le code TypeScript : {{clipboard.text}}
ja: 以下のJSONからTypeScript interfaceを生成してください。わかりやすいinterface名を使い、任意フィールドと配列を適切に扱い、TypeScriptコードのみを出力してください。 {{clipboard.text}}
ko: 아래 JSON을 기반으로 TypeScript interface를 생성하세요. 명확한 인터페이스 이름을 사용하고 선택 필드와 배열을 적절히 처리하며 TypeScript 코드만 출력하세요. {{clipboard.text}}
zh_hans: 请根据以下 JSON 生成 TypeScript interface。使用清晰的接口命名，合理处理可选字段和数组，只输出 TypeScript 代码： {{clipboard.text}}
zh_hant: 請根據以下 JSON 生成 TypeScript interface。使用清晰的介面命名，合理處理可選欄位和陣列，只輸出 TypeScript 程式碼： {{clipboard.text}}

# Preset Prompt Minify JSON
source: Minify the JSON below by removing unnecessary whitespace and line breaks. Output only the minified JSON. If the content is not valid JSON, explain the error clearly: {{clipboard.text}}
de: Minimiere das folgende JSON, indem du unnötige Leerzeichen und Zeilenumbrüche entfernst. Gib nur das minimierte JSON aus. Wenn der Inhalt kein gültiges JSON ist, erkläre den Fehler klar: {{clipboard.text}}
fr: Minifie le JSON ci-dessous en supprimant les espaces et retours à la ligne inutiles. N’affiche que le JSON minifié. Si le contenu n’est pas un JSON valide, explique clairement l’erreur : {{clipboard.text}}
ja: 以下のJSONから不要な空白と改行を削除して圧縮してください。圧縮後のJSONのみを出力してください。内容が有効なJSONでない場合は、エラーの原因を明確に説明してください。 {{clipboard.text}}
ko: 아래 JSON에서 불필요한 공백과 줄바꿈을 제거해 압축하세요. 압축된 JSON만 출력하세요. 유효한 JSON이 아니면 오류 원인을 명확히 설명하세요. {{clipboard.text}}
zh_hans: 请压缩以下 JSON，移除不必要的空格和换行。只输出压缩后的 JSON；如果内容不是合法 JSON，请指出错误原因： {{clipboard.text}}
zh_hant: 請壓縮以下 JSON，移除不必要的空格和換行。只輸出壓縮後的 JSON；如果內容不是合法 JSON，請指出錯誤原因： {{clipboard.text}}

# Preset Prompt Summarize Text
source: Summarize the content below. Preserve key facts, conclusions, and action items. Start with a short summary, then list important details as bullets: {{clipboard.text}}
de: Fasse den folgenden Inhalt zusammen. Behalte wichtige Fakten, Schlussfolgerungen und Aufgaben bei. Beginne mit einer kurzen Zusammenfassung und liste danach die wichtigsten Details als Stichpunkte auf: {{clipboard.text}}
fr: Résume le contenu ci-dessous. Conserve les faits clés, les conclusions et les actions à faire. Commence par un bref résumé, puis liste les détails importants en puces : {{clipboard.text}}
ja: 以下の内容を要約してください。重要な事実、結論、対応事項を残してください。短い要約から始め、その後に重要な詳細を箇条書きで示してください。 {{clipboard.text}}
ko: 아래 내용을 요약하세요. 핵심 사실, 결론, 할 일을 유지하세요. 짧은 요약으로 시작한 뒤 중요한 세부 사항을 글머리표로 정리하세요. {{clipboard.text}}
zh_hans: 请总结以下内容，保留关键信息、结论和待办事项。先给出简短摘要，再用要点列出细节： {{clipboard.text}}
zh_hant: 請摘要以下內容，保留關鍵資訊、結論和待辦事項。先給出簡短摘要，再用要點列出細節： {{clipboard.text}}

# Preset Prompt Translate to English
source: Translate the content below into natural, accurate English. Preserve proper nouns, code, URLs, and email addresses. Output only the translation: {{clipboard.text}}
de: Übersetze den folgenden Inhalt in natürliches und präzises Englisch. Behalte Eigennamen, Code, URLs und E-Mail-Adressen unverändert bei. Gib nur die Übersetzung aus: {{clipboard.text}}
fr: Traduis le contenu ci-dessous en anglais naturel et précis. Conserve les noms propres, le code, les URL et les adresses e-mail. N’affiche que la traduction : {{clipboard.text}}
ja: 以下の内容を自然で正確な英語に翻訳してください。固有名詞、コード、URL、メールアドレスは保持してください。翻訳文のみを出力してください。 {{clipboard.text}}
ko: 아래 내용을 자연스럽고 정확한 영어로 번역하세요. 고유명사, 코드, URL, 이메일 주소는 그대로 유지하세요. 번역문만 출력하세요. {{clipboard.text}}
zh_hans: 请将以下内容翻译为自然、准确的英文。保留专有名词、代码、URL 和邮箱地址，只输出译文： {{clipboard.text}}
zh_hant: 請將以下內容翻譯為自然、準確的英文。保留專有名詞、程式碼、URL 和郵箱地址，只輸出譯文： {{clipboard.text}}

# Preset Skill Explain Code
source: Explain Code
de: Code erklären
fr: Expliquer le code
ja: コードを説明
ko: 코드 설명
zh_hans: 解释代码
zh_hant: 解釋程式碼

# Preset Skill Extract Emails
source: Extract Emails
de: E-Mail-Adressen extrahieren
fr: Extraire les e-mails
ja: メールアドレスを抽出
ko: 이메일 추출
zh_hans: 提取邮箱
zh_hant: 提取郵箱

# Preset Skill Format JSON
source: Parse & Format JSON
de: JSON analysieren und formatieren
fr: Analyser et formater le JSON
ja: JSONを解析して整形
ko: JSON 파싱 및 서식 지정
zh_hans: 解析并格式化 JSON
zh_hant: 解析並格式化 JSON

# Preset Skill Image OCR
source: Image OCR
de: Bild-OCR
fr: OCR d’image
ja: 画像OCR
ko: 이미지 OCR
zh_hans: 图片 OCR
zh_hant: 圖片 OCR

# Preset Skill Improve Writing
source: Improve Writing
de: Text verbessern
fr: Améliorer le texte
ja: 文章を改善
ko: 글 다듬기
zh_hans: 润色文本
zh_hant: 潤飾文字

# Preset Skill JSON to TypeScript
source: JSON to TypeScript Interfaces
de: JSON in TypeScript-Interfaces umwandeln
fr: JSON vers interfaces TypeScript
ja: JSONをTypeScriptインターフェースに変換
ko: JSON을 TypeScript 인터페이스로 변환
zh_hans: JSON 转 TypeScript 接口
zh_hant: JSON 轉 TypeScript 介面

# Preset Skill Minify JSON
source: Minify JSON
de: JSON minimieren
fr: Minifier le JSON
ja: JSONを圧縮
ko: JSON 압축
zh_hans: 压缩 JSON
zh_hant: 壓縮 JSON

# Preset Skill Summarize Text
source: Summarize Text
de: Text zusammenfassen
fr: Résumer le texte
ja: テキストを要約
ko: 텍스트 요약
zh_hans: 总结文本
zh_hant: 摘要文字

# Preset Skill Translate to English
source: Translate to English
de: Ins Englische übersetzen
fr: Traduire en anglais
ja: 英語に翻訳
ko: 영어로 번역
zh_hans: 翻译为英文
zh_hant: 翻譯為英文

source: Preview
de: Vorschau
fr: Aperçu
ja: プレビュー
ko: 미리 보기
zh_hans: 预览
zh_hant: 預覽

source: Preview Panel
de: Vorschaufenster
fr: Panneau d’aperçu
ja: プレビューパネル
ko: 미리보기 패널
zh_hans: 预览面板
zh_hant: 預覽面板

source: Preview Selection
de: Auswahlvorschau
fr: Aperçu de la sélection
ja: 選択項目をプレビュー
ko: 선택 항목 미리 보기
zh_hans: 预览所选项
zh_hant: 預覽所選項

source: Preview truncated to protect memory. Pasting is not affected.
de: … (Vorschau aus Speichergründen gekürzt; Einfügen unverändert.)
fr: … (Aperçu tronqué pour la mémoire ; le collage n’est pas affecté.)
ja: …（メモリ保護のためプレビューを省略。貼り付けには影響しません。）
ko: … (메모리 보호를 위해 미리보기를 줄였습니다. 붙여넣기에는 영향 없습니다.)
zh_hans: … (文本过于巨大，为保护内存已折叠预览，粘贴时不受影响)
zh_hant: …（文字過大，為保護記憶體已摺疊預覽，貼上不影響）

source: Preview URL Prefix
de: Vorschau:
fr: Aperçu :
ja: プレビュー:
ko: 미리 보기:
zh_hans: 预览：
zh_hant: 預覽：

source: Previous List
de: Vorherige Liste
fr: Liste précédente
ja: 前のリスト
ko: 이전 목록
zh_hans: 上一个列表
zh_hant: 上一個列表

source: Privacy Policy
de: Datenschutzrichtlinie
fr: Politique de confidentialité
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh_hans: 隐私政策
zh_hant: 隱私權政策

source: Prompt Template
de: Prompt-Vorlage
fr: Modèle de prompt
ja: プロンプトテンプレート
ko: 프롬프트 템플릿
zh_hans: Prompt 模板
zh_hant: Prompt 範本

source: Provider
de: Anbieter
fr: Fournisseur
ja: プロバイダー
ko: 공급자
zh_hans: 服务商
zh_hant: 服務商

source: Provider Selection
de: Anbieterauswahl
fr: Sélection du fournisseur
ja: プロバイダー選択
ko: 공급자 선택
zh_hans: 服务商
zh_hant: 服務商

source: Purple
de: Lila
fr: Violet
ja: パープル
ko: 보라색
zh_hans: 紫色
zh_hant: 紫色

source: Quick Paste
de: Schnell einsetzen
fr: Collage rapide
ja: クイックペースト
ko: 빠른 붙여넣기
zh_hans: 快速粘贴
zh_hant: 快速貼上

source: Quickly recall, search and re-paste recently copied content.
de: Zuletzt kopierten Inhalt schnell abrufen, suchen und erneut einsetzen.
fr: Rappel, recherche et nouveau collage rapides du contenu récemment copié.
ja: 最近コピーしたコンテンツをすばやく確認、検索、再ペーストできます。
ko: 최근 복사한 내용을 빠르게 확인하고, 검색하고, 다시 붙여넣을 수 있습니다.
zh_hans: 更快回顾、搜索并重新粘贴最近复制的内容。
zh_hant: 更快地回顧、搜尋及重新貼上最近複製的內容。

source: Quit
de: Beenden
fr: Quitter
ja: 終了
ko: 종료
zh_hans: 退出
zh_hant: 退出

source: Quit Clipaste
de: Clipaste beenden
fr: Quitter Clipaste
ja: Clipaste を終了
ko: Clipaste 종료
zh_hans: 退出 Clipaste
zh_hant: 退出 Clipaste

source: Reading %@ data…
de: Lese %@-Daten…
fr: Lecture des données de %@…
ja: %@ のデータを読み込み中…
ko: %@ 데이터 읽는 중…
zh_hans: 正在读取 %@ 数据…
zh_hant: 正在讀取 %@ 資料…

source: Ready to check for updates
de: Bereit, nach Updates zu suchen
fr: Prêt à rechercher des mises à jour
ja: アップデートを確認できます
ko: 업데이트를 확인할 준비가 되었습니다
zh_hans: 可以开始检查更新
zh_hant: 可以開始檢查更新

source: Received sync status refresh request. Current route: %@
de: Anfrage zum Aktualisieren des Synchronisierungsstatus erhalten. Aktuelle Route: %1$@
fr: Demande d’actualisation de l’état de synchronisation reçue. Route actuelle : %1$@
ja: 同期状態の更新リクエストを受信しました。現在のルート：%1$@
ko: 동기화 상태 새로 고침 요청을 받았습니다. 현재 경로: %1$@
zh_hans: 收到同步状态刷新请求。当前路由：%1$@
zh_hant: 收到同步狀態重新整理要求。目前路由：%1$@

source: Received sync toggle request: %@
de: Synchronisierungsschalter-Anfrage erhalten: %1$@
fr: Demande de bascule de synchronisation reçue : %1$@
ja: 同期切り替えリクエストを受信しました：%1$@
ko: 동기화 전환 요청을 받았습니다: %1$@
zh_hans: 收到同步开关请求：%1$@
zh_hant: 收到同步開關要求：%1$@

source: Recent Error
de: Letzter Fehler
fr: Dernière erreur
ja: 直近のエラー
ko: 최근 오류
zh_hans: 最近错误
zh_hant: 最近錯誤

source: Recent Events
de: Letzte Ereignisse
fr: Événements récents
ja: 最近のイベント
ko: 최근 이벤트
zh_hans: 最近事件
zh_hant: 最近事件

source: Recent items will appear first while the full history finishes loading.
de: Neueste Elemente werden zuerst angezeigt, während der vollständige Verlauf weiter geladen wird.
fr: Les éléments récents s’affichent d’abord pendant le chargement complet de l’historique.
ja: まず最近の項目を表示し、その間に履歴全体の読み込みを続けます。
ko: 최근 항목을 먼저 표시하고, 전체 기록은 백그라운드에서 계속 불러옵니다.
zh_hans: 会先显示最近的项目，完整历史会在后台继续加载。
zh_hant: 會先顯示最近的項目，完整歷史會在背景繼續載入。

source: Recognition Result
de: Erkennungsergebnis
fr: Résultat de la reconnaissance
ja: 認識結果
ko: 인식 결과
zh_hans: 识别结果
zh_hant: 辨識結果

source: Recognize Text (OCR)
de: Text erkennen (OCR)
fr: Reconnaître le texte (OCR)
ja: テキストを認識 (OCR)
ko: 텍스트 인식 (OCR)
zh_hans: 识别图片文字 (OCR)
zh_hant: 辨識圖片文字 (OCR)

source: Recognizing…
de: Erkennung läuft…
fr: Reconnaissance en cours…
ja: 認識しています…
ko: 인식 중…
zh_hans: 正在识别…
zh_hant: 辨識中…

source: Red
de: Rot
fr: Rouge
ja: レッド
ko: 빨간색
zh_hans: 红色
zh_hant: 紅色

source: Refreshing sync status. Current route: %@
de: Synchronisierungsstatus wird aktualisiert. Aktuelle Route: %1$@
fr: Actualisation de l’état de synchronisation. Route actuelle : %1$@
ja: 同期状態を更新しています。現在のルート：%1$@
ko: 동기화 상태를 새로 고치는 중입니다. 현재 경로: %1$@
zh_hans: 开始刷新同步状态。当前路由：%1$@
zh_hant: 開始重新整理同步狀態。目前路由：%1$@
